//=============================================================================
//
// メイン処理 [main.h]
// Author : AKIRA TANAKA
//
//=============================================================================
#ifndef _MAIN_H_
#define _MAIN_H_

//ライブラリ
#pragma comment (lib,"dinput8.lib")
#pragma comment (lib, "xinput.lib")
//*****************************************************************************
// ヘッダファイル
//*****************************************************************************
#include "windows.h"
#include <d3dx9.h>
#include <dinput.h>
#include <XAudio2.h>
#include "TexPassHead.h"
#include "structHeader.h"
#include "typedefHead01.h"
#include "StageDataHeader.h"
#include "defineHeader.h"

//*****************************************************************************
// ライブラリファイル
// [構成プロパティ]->[リンカー]->[入力]->[追加の依存ファイル]に記述しても可能
//*****************************************************************************
#pragma comment (lib, "d3d9.lib")
#pragma comment (lib, "d3dx9.lib")
#pragma comment (lib, "dxguid.lib")
#pragma comment (lib, "winmm.lib")

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define SCREEN_WIDTH	(1280)		// ウインドウの幅
#define SCREEN_HEIGHT	(720)		// ウインドウの高さ

#define PI (3.14159265359)            //円周率
#define GRAVITY_ACC (1.0f)            //重力加速度

// 頂点フォーマット( 頂点座標[2D] / 頂点カラー / テクスチャ座標 )
#define	FVF_VERTEX_2D	(D3DFVF_XYZRHW | D3DFVF_DIFFUSE | D3DFVF_TEX1)

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
D3DXVECTOR3 GetMousePosInWindow(void);

class CRenderer;
class CScene;
class CScene2D;
#endif